In [1]:
import pandas as pd

In [2]:
#Using list
lst1 = [1,2,3,4,5]
df1 = pd.DataFrame(lst1)

In [4]:
df1

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
#Using list of list
lst2 = [[1,2,3,4,5],[10,20,30,40,50]]
df2 = pd.DataFrame(lst2)
df2

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

In [8]:
lst3 = [['Ajay',70],['Raj',89],['Binay',78]]
df3 = pd.DataFrame(lst3, columns=['Name','Marks'])
df3

    Name  Marks
0   Ajay     70
1    Raj     89
2  Binay     78

In [9]:
#Using dictionary
data = {'Name':['Raj','Rahul','Abhi'],'Marks':[89,78,70]}
df4 = pd.DataFrame(data)
df4

    Name  Marks
0    Raj     89
1  Rahul     78
2   Abhi     70

In [10]:
#Using dictionary
data1 = {'Name':['Dhaaj','Bahul','Abhinabh'],'Marks':[89,78,70]}
df5 = pd.DataFrame(data1,index=['Student1','Student2','Student3'])
df5

              Name  Marks
Student1     Dhaaj     89
Student2     Bahul     78
Student3  Abhinabh     70

In [12]:
#Using List of Dictionary
lst4 = [{'a':1,'b':2,'c':3},
       {'a':45,'b':89,'c':90},
       {'a':34,'b':56}]
df6 = pd.DataFrame(lst4)
df6

    a   b     c
0   1   2   3.0
1  45  89  90.0
2  34  56   NaN

In [16]:
#Using Zip Function
Names = ['Raj','Rahul','Ajay']
Marks = [56,79,90]
list_of_students = list(zip(Names,Marks))
list_of_students

df7 = pd.DataFrame(list_of_students, columns=['Names','Marks'])
df7

   Names  Marks
0    Raj     56
1  Rahul     79
2   Ajay     90

In [23]:
#Using Dictionary of Pandas Series
data2= {'Raj':pd.Series([56,78,90,90]),
       'Ajay':pd.Series([46,67,88,99])}
df8 = pd.DataFrame(data2)
df8

   Raj  Ajay
0   56    46
1   78    67
2   90    88
3   90    99